codewarlocks/stm32f7-Pedalboard/Projects/STM32746G-Discovery/Examples/BSP/SW4STM32/STM32746G_DISCOVERY/Example/User/gui.c
void handleIzquierdaButton(PedalElement *bt, GUITouchState *touch)
{
	if (touch->touchDetected)
	{
		// touch detected...
			uint16_t x = touch->touchX[0];
			uint16_t y = touch->touchY[0];
			if (x >= bt->botones->flecha_izquierda->x && x < bt->botones->flecha_izquierda->x + bt->botones->flecha_izquierda->width && y >= bt->botones->flecha_izquierda->y && y < bt->botones->flecha_izquierda->y + bt->botones->flecha_izquierda->height)
			{
				bt->botones->flecha_izquierda->callback(bt);
			}
	}
}

void handleHomeButton(PedalElement *bt, GUITouchState *touch)
{
	if (touch->touchDetected)
	{
		// touch detected...
			uint16_t x = touch->touchX[0];
			uint16_t y = touch->touchY[0];
			if (x >= bt->botones->home->x && x < bt->botones->home->x + bt->botones->home->width && y >= bt->botones->home->y && y < bt->botones->home->y + bt->botones->home->height)
			{
				bt->botones->home->callback(bt);
			}
	}
}
//

//Callbacks
void LinkCallback(PedalElement *e)
{
	switch(e->link->nombre)
	{
		case DELAY:
			DrawScreen(DELAY);
			pedal_individual=1;
			seleccion_pedal=DELAY;
		break;
	    case TREMOLO:
		    DrawScreen(TREMOLO);
			pedal_individual=1;
			seleccion_pedal=TREMOLO;
	    break;
	    case VIBRATO:
		    DrawScreen(VIBRATO);
			pedal_individual=1;
			seleccion_pedal=VIBRATO;
	    break;
	    case DISTORSION:
	    	DrawScreen(DISTORSION);
	    	seleccion_pedal=DISTORSION;
			pedal_individual=1;
	    break;
	    case WHA:
		    DrawScreen(WHA);
			pedal_individual=1;
			seleccion_pedal=WHA;
	    break;
	    case RINGMOD:
		    DrawScreen(RINGMOD);
			pedal_individual=1;
			seleccion_pedal=RINGMOD;
	    break;
	}
	PedalForceRedraw(e);

}

void PushCallback(PedalElement *e)
{

	if (e->push->push_state & (GUI_DIRTY|GUI_HOVER))
	{
			uint8_t states = e->push->push_state & GUI_ONOFF_MASK;
			if (pedal_individual==0)
			{
				if(states == GUI_ON)
				{
					switch(e->push->push_menu->nombre)
					{
						case DELAY:
							drawBitmapRaw(89,99,5,5, (uint8_t*)delayprendidomenu, CM_ARGB8888, 1);
							break;
						case TREMOLO:
							drawBitmapRaw(231,25,8,8, (uint8_t*)tremoloprendidomenu, CM_ARGB8888, 1);
							break;
						case VIBRATO:
							drawBitmapRaw(341,99,5,5, (uint8_t*)vibratoprendidomenu, CM_ARGB8888, 1);
							break;
						case DISTORSION:
							drawBitmapRaw(90,229,5,5, (uint8_t*)distorsionprendidomenu, CM_ARGB8888, 1);
							break;
						case WHA:
							drawBitmapRaw(232,207,6,6, (uint8_t*)whaprendidomenu, CM_ARGB8888, 1);
							break;
						case RINGMOD:
							drawBitmapRaw(340,239,6,6, (uint8_t*)ringprendidomenu, CM_ARGB8888, 1);
							break;
					}
				}
				else
				{
					switch(e->push->push_menu->nombre)
					{
 	 	 	 			case DELAY:
 	 	 	 				drawBitmapRaw(89,99,5,5, (uint8_t*)delayapagadomenu, CM_ARGB8888, 1);
 	 	 	 				break;
 	 	 	 			case TREMOLO:
 	 	 	 				drawBitmapRaw(231,25,8,8, (uint8_t*)tremoloapagadomenu, CM_ARGB8888, 1);
 	 	 	 				break;
 	 	 	 			case VIBRATO:
 	 	 	 				drawBitmapRaw(341,99,5,5, (uint8_t*)vibratoapagadomenu, CM_ARGB8888, 1);
 	 	 	 				break;
 	 	 	 			case DISTORSION:
 	 	 	 				drawBitmapRaw(90,229,5,5, (uint8_t*)distorsionapagadomenu, CM_ARGB8888, 1);
 	 	 	 				break;
 	 	 	 			case WHA:
 	 	 	 				drawBitmapRaw(232,207,6,6, (uint8_t*)whaapagadomenu, CM_ARGB8888, 1);
 	 	 	 				break;
 	 	 	 			case RINGMOD:
 	 	 	 				drawBitmapRaw(340,239,6,6, (uint8_t*)ringapagadomenu, CM_ARGB8888, 1);
 	 	 	 				break;
					}
				}
				// clear dirty flag
			e->push->push_state &= ~((uint16_t) GUI_DIRTY);
			}
			else
			{
				if(states == GUI_ON)
				{
					switch(e->push->push_indiv->nombre)
					{
						case DELAY:

							drawBitmapRaw(196,200,10,9, (uint8_t*)Delayledprendido, CM_ARGB8888, 1);
							break;
						case TREMOLO:
							drawBitmapRaw(228,29,23,24, (uint8_t*)LedTremoloprendido, CM_ARGB8888, 1);
							break;
						case VIBRATO:
							drawBitmapRaw(196,200,11,10, (uint8_t*)Vibratoledprendido, CM_ARGB8888, 1);
							break;
						case DISTORSION:
							drawBitmapRaw(198,198,9,9, (uint8_t*)Distorsionledprendido, CM_ARGB8888, 1);
							break;
						case WHA:
							drawBitmapRaw(230,149,19,18, (uint8_t*)Wahledprendido, CM_ARGB8888, 1);
							break;
						case RINGMOD:
							drawBitmapRaw(195,222,10,10, (uint8_t*)Ringledprendido, CM_ARGB8888, 1);
							break;
					}
				}
				else
				{
					switch(e->push->push_indiv->nombre)
					{
 	 	 	 			case DELAY:
 	 	 	 				drawBitmapRaw(196,200,10,9, (uint8_t*)Delayledapagado, CM_ARGB8888, 1);
 	 	 	 				break;
 	 	 	 			case TREMOLO:
 	 	 	 				drawBitmapRaw(228,29,23,24, (uint8_t*)LedTremoloapagado, CM_ARGB8888, 1);
 	 	 	 				break;
 	 	 	 			case VIBRATO:
 	 	 	 				drawBitmapRaw(196,200,11,10, (uint8_t*)Vibratoledapagado, CM_ARGB8888, 1);
 	 	 	 				break;
 	 	 	 			case DISTORSION:
 	 	 	 				drawBitmapRaw(198,198,9,9, (uint8_t*)Distorsionledapagado, CM_ARGB8888, 1);
 	 	 	 				break;
 	 	 	 			case WHA:
 	 	 	 				drawBitmapRaw(230,149,19,18, (uint8_t*)Wahledapagado, CM_ARGB8888, 1);
 	 	 	 				break;
 	 	 	 			case RINGMOD:
 	 	 	 				drawBitmapRaw(195,222,10,10, (uint8_t*)Ringledapagado, CM_ARGB8888, 1);
 	 	 	 				break;
					}
				}
				// clear dirty flag
			e->push->push_state &= ~((uint16_t) GUI_DIRTY);
			}
	}
}

void LinkDerechaCallback(PedalElement *e)
{
	 seleccion_pedal++;
	 DrawScreen(seleccion_pedal);
	 if(e->push->push_state==GUI_ON)
	 {
		 e->push->push_state=GUI_OFF|GUI_HOVER|GUI_DIRTY;
	 }
}

void LinkIzquierdaCallback(PedalElement *e)
{
	seleccion_pedal--;
    DrawScreen(seleccion_pedal);
	if(e->push->push_state==GUI_ON)
	{
		e->push->push_state=GUI_OFF|GUI_HOVER|GUI_DIRTY;
	}
}

void LinkHomeCallback(PedalElement *e)
{
	pedal_individual=0;
	DrawScreen(MENU);
	seleccion_pedal=20;
}
//


void initPedals() {
	//Inicializo las perillas
	//Delay
	Pedales[0] = initPerilla(3);
	Pedales[0]->perilla->perillas[0] = guiDialButton(0, "", 174, 36, 0.0f, 0.045f, &perilla5252, Delay_Feedback);
	Pedales[0]->perilla->perillas[1] = guiDialButton(1, "", 253, 36, 0.0f, 0.045f, &perilla5252,Delay_Time);
	Pedales[0]->perilla->perillas[2] = guiDialButton(2, "", 220, 82, 0.0f, 0.045f, &perilla4241,Delay_Level);
	//Tremolo
	Pedales[1] = initGUI(3);
	Pedales[1]->perilla->perillas[0] = guiDialButton(0, "", 167, 40, 0.0f, 0.045f, &perilla4241, Tremolo_Depth);
	Pedales[1]->perilla->perillas[1] = guiDialButton(1, "", 269, 39, 0.0f, 0.045f, &perilla4241,Tremolo_Rate);
	Pedales[1]->perilla->perillas[2] = guiDialButton(2, "", 220, 66, 0.0f, 0.045f, &tremoloonda,Tremolo_Mod);
	//Vibrato
	Pedales[2] = initGUI(3);
	Pedales[2]->perilla->perillas[0] = guiDialButton(0, "", 180, 43, 0.0f, 0.045f, &perilla4241, Vibrato_Rate);
	Pedales[2]->perilla->perillas[1] = guiDialButton(1, "", 257, 43, 0.0f, 0.045f, &perilla4241,Vibrato_Depth);
	Pedales[2]->perilla->perillas[2] = guiDialButton(2, "", 223, 86, 0.0f, 0.045f, &vibratoonda,Vibrato_Mod);
	//Distorsion
	Pedales[3] = initGUI(2);
	Pedales[3]->perilla->perillas[0] = guiDialButton(0, "", 179, 26, 0.0f, 0.045f, &perilla5252, NULL);
	Pedales[3]->perilla->perillas[1] = guiDialButton(1, "", 249, 26, 0.0f, 0.045f, &perilla5252,NULL);
	//Autowah
	Pedales[4] = initGUI(4);
	Pedales[4]->perilla->perillas[0] = guiDialButton(0, "", 119, 41, 0.0f, 0.045f, &perilla4241, Autowah_Depth);
	Pedales[4]->perilla->perillas[1] = guiDialButton(1, "", 186, 41, 0.0f, 0.045f, &perilla4241,Autowah_Rate);
	Pedales[4]->perilla->perillas[2] = guiDialButton(2, "", 251, 41, 0.0f, 0.045f, &perilla4241,Autowah_Volume);
	Pedales[4]->perilla->perillas[3] = guiDialButton(2, "", 319, 41, 0.0f, 0.045f, &whaonda,Autowah_Mod);
	//Ringmode
	Pedales[5] = initGUI(1);
	Pedales[5]->perilla->perillas[0] = guiDialButton(0, "", 223, 73, 0.0f, 0.045f, &perilla3535, Ringmod_Rate);
	//

	//Inicializo los Push (3pdt)
	//PEDALES Menu
	Pedales[0]->push->push_menu=initPushLink(DELAY,80,16+110/2,58,110/2,PushCallback, handlePushMenuButton);
	Pedales[1]->push->push_menu=initPushLink(TREMOLO,195,16+110/2,80,110/2,PushCallback, handlePushMenuButton);
	Pedales[2]->push->push_menu=initPushLink(VIBRATO,332,16+110/2,57,110/2,PushCallback, handlePushMenuButton);
	Pedales[3]->push->push_menu=initPushLink(DISTORSION,80,147+110/2,58,110/2,PushCallback, handlePushMenuButton);
	Pedales[4]->push->push_menu=initPushLink(WHA,185,158+88/2,100,88/2,PushCallback, handlePushMenuButton);
	Pedales[5]->push->push_menu=initPushLink(RINGMOD,326,147+110/2,68,110/2,PushCallback, handlePushMenuButton);

