codewarlocks/stm32f7-Pedalboard/Projects/STM32746G-Discovery/Examples/BSP/SW4STM32/STM32746G_DISCOVERY/Example/User/gui.c
	//PEDALES Individuales
	Pedales[0]->push->push_indiv=initPushLink(DELAY,225,189,31,33,PushCallback, handlePushIndividualButton);
	Pedales[1]->push->push_indiv=initPushLink(TREMOLO,222,203,36,36,PushCallback, handlePushIndividualButton);
	Pedales[2]->push->push_indiv=initPushLink(VIBRATO,221,188,37,37,PushCallback, handlePushIndividualButton);
	Pedales[3]->push->push_indiv=initPushLink(DISTORSION,223,184,35,35,PushCallback, handlePushIndividualButton);
	Pedales[4]->push->push_indiv=initPushLink(WHA,218,213,41,41,PushCallback, handlePushIndividualButton);
	Pedales[5]->push->push_indiv=initPushLink(RINGMOD,223,210,35,34,PushCallback, handlePushIndividualButton);

	//PEDALES estados
	Pedales[0]->push->push_state=GUI_OFF;
	Pedales[1]->push->push_state=GUI_OFF;
	Pedales[2]->push->push_state=GUI_OFF;
	Pedales[3]->push->push_state=GUI_OFF;
	Pedales[4]->push->push_state=GUI_OFF;
	Pedales[5]->push->push_state=GUI_OFF;
	//

	//Inicializo los links de los pedales
	Pedales[0]->link=initPushLink(DELAY, 3,80,16,58,110/2,LinkCallback, handleLinkButton);
	Pedales[1]->link=initPushLink(TREMOLO, 3,195,16,80,110/2,LinkCallback, handleLinkButton);
	Pedales[2]->link=initPushLink(VIBRATO, 3,332,16,57,110/2,LinkCallback, handleLinkButton);
	Pedales[3]->link=initPushLink(DISTORSION, 2,80,147,58,110/2,LinkCallback, handleLinkButton);
	Pedales[4]->link=initPushLink(WHA,4,185,158,100,88/2,LinkCallback, handleLinkButton);
	Pedales[5]->link=initPushLink(RINGMOD,1,326,147,68,110/2,LinkCallback, handleLinkButton);
	//

	//Inicializo los botones de las pantallas individuales de los pedales
	Pedales[0]->botones->flecha_derecha=initPushLink(DERECHA,0,417,84,61,107,LinkDerechaCallback, handleDerechaButton);
	Pedales[0]->botones->flecha_izquierda=initPushLink(IZQUIERDA,0,0,84,61,107,LinkIzquierdaCallback, handleIzquierdaButton);
	Pedales[0]->botones->home=initPushLink(HOME,0,0,0,70,70,LinkHomeCallback, handleHomeButton);

	Pedales[1]->botones->flecha_derecha=initPushLink(DERECHA,0,417,84,61,107,LinkDerechaCallback, handleDerechaButton);
	Pedales[1]->botones->flecha_izquierda=initPushLink(IZQUIERDA,0,0,84,61,107,LinkIzquierdaCallback, handleIzquierdaButton);
	Pedales[1]->botones->home=initPushLink(HOME,0,0,0,70,70,LinkHomeCallback, handleHomeButton);

	Pedales[2]->botones->flecha_derecha=initPushLink(DERECHA,0,417,84,61,107,LinkDerechaCallback, handleDerechaButton);
	Pedales[2]->botones->flecha_izquierda=initPushLink(IZQUIERDA,0,0,84,61,107,LinkIzquierdaCallback, handleIzquierdaButton);
	Pedales[2]->botones->home=initPushLink(HOME,0,0,0,70,70,LinkHomeCallback, handleHomeButton);

	Pedales[3]->botones->flecha_derecha=initPushLink(DERECHA,0,417,84,61,107,LinkDerechaCallback, handleDerechaButton);
	Pedales[3]->botones->flecha_izquierda=initPushLink(IZQUIERDA,0,0,84,61,107,LinkIzquierdaCallback, handleIzquierdaButton);
	Pedales[3]->botones->home=initPushLink(HOME,0,0,0,70,70,LinkHomeCallback, handleHomeButton);

	Pedales[4]->botones->flecha_derecha=initPushLink(DERECHA,0,417,84,61,107,LinkDerechaCallback, handleDerechaButton);
	Pedales[4]->botones->flecha_izquierda=initPushLink(IZQUIERDA,0,0,84,61,107,LinkIzquierdaCallback, handleIzquierdaButton);
	Pedales[4]->botones->home=initPushLink(HOME,0,0,0,70,70,LinkHomeCallback, handleHomeButton);

	Pedales[5]->botones->flecha_derecha=initPushLink(DERECHA,0,417,84,61,107,LinkDerechaCallback, handleDerechaButton);
	Pedales[5]->botones->flecha_izquierda=initPushLink(IZQUIERDA,0,0,84,61,107,LinkIzquierdaCallback, handleIzquierdaButton);
	Pedales[5]->botones->home=initPushLink(HOME,0,0,0,70,70,LinkHomeCallback, handleHomeButton);
	//
}
